# GetReleaseType Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalMember..::..GetReleaseType Method
AnalyticalMember Class See Also
---
Gets the release type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public ReleaseType GetReleaseType(
	bool start
)
```

Visual Basic
---
```text
Public Function GetReleaseType ( _
	start As Boolean _
) As ReleaseType
```

Visual C++
---
```text
public:
ReleaseType GetReleaseType(
	bool start
)
```

# ### Parameters
start
    Type: System..::..Boolean The position on Analytical Member element. True for start, false for end.
# ### Return Value
The type of release.
# See Also
AnalyticalMember Class
Autodesk.Revit.DB.Structure Namespace